IDEA Open Model
IGeometryPart.Edges Property
Compatible with IDEA StatiCa Beta 20.0
 Lines of input edges on wall or beam
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
List<ReferenceElement> Edges { get; set; }
Property Edges As List(Of ReferenceElement)
	Get
	Set
Property Value
Type: List<ReferenceElement>
See Also
Reference
IGeometryPart Interface
IdeaRS.OpenModel.Detail Namespace